InformationRegisters/ВыгруженныеЗаказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ВыгруженныеЗаказы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыгрузкиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПодборМарок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусВыгрузкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусВыгрузкиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженПовторно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаПодборМарок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаказНаПодборМарок</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьССервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркиПолностьюПодобраны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПодобрано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодобранныеМарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ПодключенныеСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ПодключенныеСервисы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменВключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключенияКСерверу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКСерверу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМобильногоУстройства</Name>
					<Comment>Идентификатор мобильного устройства на сервере</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СервисыСервера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСервиса</Name>
							<Comment>Произвольное наименование сервиса</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКСервису</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначения/Ext/Module.bsl
Функция НайтиПодключенныйСервисПоИДМУ(ИДМУ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодключенныеСервисы.Ссылка
	|ИЗ
	|	Справочник.ПодключенныеСервисы КАК ПодключенныеСервисы
	|ГДЕ
	|	ПодключенныеСервисы.ИдентификаторМобильногоУстройства = &ИдентификаторМобильногоУстройства");
	Запрос.УстановитьПараметр("ИдентификаторМобильногоУстройства", ИДМУ);
	Выборка = Запрос.Выполнить().Выбрать();
	ПодключенныйСервис = Справочники.ПодключенныеСервисы.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		ПодключенныйСервис = Выборка.Ссылка;
	КонецЕсли;
	Возврат ПодключенныйСервис;
КонецФункции

Функция ПолучитьПодключенныйСервисПоУмолчанию() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодключенныеСервисы.Ссылка КАК ПодключенныйСервис
	|ИЗ
	|	Справочник.ПодключенныеСервисы КАК ПодключенныеСервисы
	|ГДЕ
	|	ПодключенныеСервисы.ИспользоватьПоУмолчанию");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПодключенныйСервис;
	КонецЕсли;
	Возврат Справочники.ПодключенныеСервисы.ПустаяСсылка();
КонецФункции

Функция ПолучитьПодобранныеМаркиВФорматеJSON (ЗаказНаПодборМарок = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено (ЗаказНаПодборМарок) Тогда
		Запрос.Текст = ПолучитьТекстЗапросаНаПринудительнуюВыгрузкуЗаказа();
		Запрос.УстановитьПараметр("Ссылка",ЗаказНаПодборМарок);
	Иначе
		Запрос.Текст = ПолучитьТекстЗапросаНаВыгрузкуЗаказов();
	КонецЕсли;
	СтруктураЗаказы = Новый Структура("Заказы",Новый Массив);
	ВыборкаЗаказы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаказы.Следующий() Цикл
		СтруктураЗаказ = Новый Структура("ЗаказСсылка,Марки",ВыборкаЗаказы.ДокументЗаказ,Новый Массив);
		ЗаменитьСсылкиНаУИД (СтруктураЗаказ,"ЗаказСсылка");
		СтруктураЗаказы.Заказы.Добавить(СтруктураЗаказ);		
		ВыборкаДетали = ВыборкаЗаказы.Выбрать();		
		Пока ВыборкаДетали.Следующий() Цикл
			СтруктураМарка = Новый Структура("НоменклатураСсылка,ХарактеристикаСсылка,GTIN,СерийныйНомер");
			ЗаполнитьЗначенияСвойств(СтруктураМарка,ВыборкаДетали);
			ЗаменитьСсылкиНаУИД (СтруктураМарка,"НоменклатураСсылка,ХарактеристикаСсылка");
			СтруктураЗаказ.Марки.Добавить(СтруктураМарка);		
		КонецЦикла;		
	КонецЦикла;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,СтруктураЗаказы);		
	Возврат ЗаписьJSON.Закрыть();	
	
КонецФункции

Процедура ЗаменитьСсылкиНаУИД (СтруктураДанных,ИменаКлючейСсылок)
	МассивКлючей = СтрРазделить(ИменаКлючейСсылок,",");
	Если НЕ МассивКлючей.Количество() Тогда
		Возврат;
	КонецЕсли;
	Для каждого эл из МассивКлючей Цикл
		Если СтруктураДанных.Свойство(эл) И ЗначениеЗаполнено(СтруктураДанных[эл]) Тогда
			СтруктураДанных[эл] = Строка(СтруктураДанных[эл].УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТекстЗапросаНаПринудительнуюВыгрузкуЗаказа()
	Возврат	"ВЫБРАТЬ
	|	ЗаказНаПодборМарок.Ссылка
	|ПОМЕСТИТЬ ВТЗаказ
	|ИЗ
	|	Документ.ЗаказНаПодборМарок КАК ЗаказНаПодборМарок
	|ГДЕ
	|	ЗаказНаПодборМарок.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаказ.Ссылка КАК ДокументЗаказ,
	|	ВЗ.Номенклатура КАК НоменклатураСсылка,
	|	ВЗ.Характеристика КАК ХарактеристикаСсылка,
	|	ВЗ.GTIN КАК GTIN,
	|	ВЗ.СерийныйНомер КАК СерийныйНомер
	|ИЗ
	|	ВТЗаказ КАК ВТЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказНаПодборМарокТовары.Ссылка КАК ДокументЗаказ,
	|			ЗаказНаПодборМарокТовары.Номенклатура КАК Номенклатура,
	|			ЗаказНаПодборМарокТовары.Характеристика КАК Характеристика,
	|			ЗаказНаПодборМарокПодобранныеМарки.GTIN КАК GTIN,
	|			ЗаказНаПодборМарокПодобранныеМарки.СерийныйНомер КАК СерийныйНомер
	|		ИЗ
	|			Документ.ЗаказНаПодборМарок.Товары КАК ЗаказНаПодборМарокТовары
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПодборМарок.ПодобранныеМарки КАК ЗаказНаПодборМарокПодобранныеМарки
	|				ПО ЗаказНаПодборМарокТовары.Ссылка = ЗаказНаПодборМарокПодобранныеМарки.Ссылка
	|				И ЗаказНаПодборМарокТовары.КлючСтроки = ЗаказНаПодборМарокПодобранныеМарки.КлючСтроки) ВЗ
	|		ПО ВТЗаказ.Ссылка = ВЗ.ДокументЗаказ
	|ИТОГИ
	|ПО
	|	ДокументЗаказ";
КонецФункции

Функция ПолучитьТекстЗапросаНаВыгрузкуЗаказов()
	Возврат	"ВЫБРАТЬ
	|	ВЗ.ДокументЗаказ КАК ДокументЗаказ,
	|	ВЗ.Номенклатура КАК НоменклатураСсылка,
	|	ВЗ.Характеристика КАК ХарактеристикаСсылка,
	|	ВЗ.GTIN КАК GTIN,
	|	ВЗ.СерийныйНомер КАК СерийныйНомер
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказНаПодборМарокТовары.Ссылка КАК ДокументЗаказ,
	|		ЗаказНаПодборМарокТовары.Номенклатура КАК Номенклатура,
	|		ЗаказНаПодборМарокТовары.Характеристика КАК Характеристика,
	|		ЗаказНаПодборМарокПодобранныеМарки.GTIN КАК GTIN,
	|		ЗаказНаПодборМарокПодобранныеМарки.СерийныйНомер КАК СерийныйНомер
	|	ИЗ
	|		Документ.ЗаказНаПодборМарок.Товары КАК ЗаказНаПодборМарокТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПодборМарок.ПодобранныеМарки КАК ЗаказНаПодборМарокПодобранныеМарки
	|			ПО ЗаказНаПодборМарокТовары.Ссылка = ЗаказНаПодборМарокПодобранныеМарки.Ссылка
	|			И ЗаказНаПодборМарокТовары.КлючСтроки = ЗаказНаПодборМарокПодобранныеМарки.КлючСтроки) ВЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгруженныеЗаказы КАК РСВыгруженныеЗаказы
	|		ПО ВЗ.ДокументЗаказ = РСВыгруженныеЗаказы.Заказ
	|		И НЕ (РСВыгруженныеЗаказы.СтатусВыгрузки = ЗНАЧЕНИЕ(Перечисление.СтатусВыгрузкиДокументов.Выгружен)
	|		ИЛИ РСВыгруженныеЗаказы.СтатусВыгрузки = ЗНАЧЕНИЕ(Перечисление.СтатусВыгрузкиДокументов.ВыгруженПовторно))
	|ГДЕ
	|	РСВыгруженныеЗаказы.Заказ ЕСТЬ NULL
	|ИТОГИ
	|ПО
	|	ДокументЗаказ";
КонецФункции
